let time = 3000
let maxRow = 5
let maxCol = 5
let itemShowingMap = {}
let lastName = '袁'
let t1 = ["偀", "桑", "桜", "恩", "聪", "悠", "风", "飘", "飞", "森", "多", "天", "央", "光", "煊", "奚", "兮", "祯", "西", "妃", "妆", "香", "熙", "馡", "冬", "妮", "冰", "熹", "秋", "姑", "金", "科", "姗", "姜", "姝", "姣", "姬", "姯", "臻", "姿", "娇", "娉", "舒", "初", "娟", "樱", "婀", "骄", "芊", "抒", "芝", "芬", "花", "芳", "苏", "高", "章", "嫣", "端", "英", "欢", "欣", "茵", "千", "歆", "歌", "孤", "卿", "安", "玑", "宣", "箫", "宫", "宵", "莺", "菁", "珂", "珊", "双", "珍", "诗", "珠", "司", "尐", "君", "琛", "萧", "琨", "萱", "氷", "瑛", "江", "瑰", "山", "葱", "葳", "钊", "璎", "钗", "甄", "锌", "甘", "贞", "生", "津", "洲", "攸", "商", "斯", "薰", "新", "方", "施", "川", "淞", "痴", "添", "一", "七", "清", "嘉", "三", "希", "专", "昕", "东", "丝", "星", "春", "温", "昭", "帮", "丰", "丹", "鹃", "之", "晖", "湘", "书", "晰", "晶", "湾", "庄", "暄", "滇", "今", "雍", "仙", "囡", "曦", "雰", "开", "霄", "伊", "霏", "优", "霜", "真", "张", "伤", "缨", "漪", "潇", "青", "彨", "轩", "佳", "松", "辉", "羙", "依", "枫", "心", "柒", "忠", "忧", "修", "柯", "音", "忻"]
let t2 = ["怀", "怡", "倪", "倰", "格", "桃", "桐", "恬", "灵", "颀", "袁", "梅", "炎", "颐", "颜", "梧", "梨", "棠", "裴", "愉", "然", "元", "慈", "楠", "兰", "奴", "祺", "楼", "如", "榆", "妍", "榕", "农", "妤", "妶", "离", "禾", "凌", "槐", "姚", "凝", "姞", "凡", "秦", "姮", "凰", "言", "成", "娘", "则", "娥", "爰", "娴", "婕", "扬", "良", "驰", "婵", "婷", "承", "芃", "芙", "媱", "芸", "芹", "苓", "嫔", "苗", "勤", "童", "嫦", "嫱", "竹", "茗", "笛", "荃", "孒", "博", "荣", "学", "荭", "玄", "莓", "宜", "玫", "环", "莱", "莲", "玲", "宸", "容", "莹", "评", "珆", "珉", "菊", "词", "珑", "寒", "菱", "珴", "琅", "吉", "萌", "萍", "名", "萝", "吟", "尤", "琦", "萦", "琪", "含", "琳", "琴", "琼", "瑜", "豪", "葵", "瑶", "沂", "璇", "岑", "岚", "咛", "璞", "璠", "河", "咸", "铃", "瓃", "蓉", "泓", "哲", "银", "瓶", "泽", "洁", "崇", "洋", "甜", "贤", "洮", "田", "由", "流", "嵘", "蕤", "涟", "涵", "淇", "藤", "闲", "淳", "闳", "明", "阑", "丞", "渟", "鸣", "阳", "常", "鸾", "鸿", "湄", "陈", "湉", "乔", "晗", "晨", "平", "晴", "白", "隅", "于", "源", "云", "纨", "庭", "亭", "纯", "溶", "人", "黄", "雄", "盈", "黎", "滢", "仪", "绫", "园", "雯", "维", "曹", "国", "眉", "霓", "漓", "霖", "弘", "霞", "弥", "漩", "伶", "彤", "来", "杨", "彭", "杭", "杰", "蝶", "蝾", "融", "林", "龙", "澜", "侬", "辰", "瞳", "达", "迎", "城", "翎", "柔", "连", "柠", "濡", "韦", "迪", "韶", "迷"]
let t3 = ["倚", "火", "恺", "梓", "颖", "炜", "惋", "允", "祖", "楚", "典", "冉", "冷", "秉", "野", "姐", "姳", "舞", "爽", "婉", "芷", "嫂", "苇", "苒", "北", "午", "草", "荏", "筱", "宇", "宝", "玮", "许", "访", "友", "古", "小", "尔", "尕", "谨", "琬", "启", "琰", "水", "永", "尹", "展", "米", "瑾", "粉", "咏", "璟", "品", "泯", "锦", "紫", "甫", "蔼", "蕊", "敏", "海", "蕾", "斐", "喜", "旎", "巧", "闵", "淼", "昶", "渺", "乃", "晓", "井", "暖", "以", "绮", "朗", "伟", "霭", "朵", "佁", "李", "彩", "影", "美", "羽", "染", "远", "保", "矢", "俨", "柳"]
let t4 = ["树", "倩", "逸", "怿", "桂", "偌", "道", "桦", "恨", "顺", "顾", "灿", "悌", "悦", "梦", "碧", "墨", "炫", "傲", "梵", "邵", "烁", "郁", "郑", "裕", "惠", "胤", "磬", "意", "夜", "太", "焱", "慕", "奕", "煜", "奥", "慧", "照", "醉", "妙", "馥", "妹", "冽", "秀", "觅", "凤", "姲", "致", "姹", "懿", "娅", "刖", "列", "娣", "爱", "穆", "婧", "牧", "艳", "艺", "媚", "芮", "立", "苑", "嫒", "竣", "茉", "笑", "献", "振", "荇", "卉", "半", "荌", "荔", "孟", "季", "步", "莉", "玉", "玥", "寄", "叆", "密", "又", "富", "毓", "菡", "叡", "珺", "诺", "琇", "向", "谧", "琭", "琲", "籁", "豆", "汇", "汉", "瑗", "瑞", "瑟", "呤", "豫", "璐", "沐", "沛", "粟", "璧", "钰", "蓓", "洌", "锐", "洛", "贝", "素", "蔡", "唱", "画", "政", "畅", "蕙", "赛", "赞", "浩", "赫", "蕴", "善", "越", "薏", "润", "綪", "跃", "淡", "旦", "旭", "问", "路", "布", "帅", "昊", "易", "世", "映", "昱", "渲", "际", "义", "晋", "晏", "晔", "湛", "鹤", "幸", "智", "幻", "幼", "庆", "皓", "亚", "亦", "麦", "暮", "线", "亿", "雁", "默", "绚", "黛", "绛", "滟", "绢", "绣", "代", "继", "绪", "仲", "建", "曼", "盼", "霁", "月", "霈", "弋", "望", "木", "未", "漾", "杏", "靖", "彗", "静", "束", "彦", "佩", "轶", "睿", "澈", "羡", "忆", "俏", "俐", "运", "志", "翠", "韧", "俪", "韫", "翰", "念", "韵"]
let s1 = t1.length
let s2 = t2.length
let s3 = t3.length
let s4 = t4.length
let ts = [t1, t2, t3, t4]
let ss = [s1, s2, s3, s4]
let names = ["幼蓉", "秋阳", "念真", "冰兰", "芝蓉", "问丝", "晓凡", "凤歌", "代梅", "倩愉", "昕妍", "苏弥", "姝瑶", "玮琪", "冰凡", "昕妤", "璟雯", "北晶", "清莹", "紫丝", "优扬", "静芙", "密如", "芳苓", "锦曦", "野云", "觅柔", "婉柔", "盼丹", "鹤梅", "黛娥", "梓洁", "紫云", "新晴", "蕴涵", "贞怡", "芳荃", "倩成", "映天", "慕涵", "炜琳", "晶滢", "蕙兰", "玉妍", "湛娟", "影梅", "未央", "飞瑶", "羽彤", "诗桃", "梓涵", "世英", "孤晴", "映秋", "小凝", "青蓉", "熙阳", "小凡", "玉娟", "翠安", "依玲", "傲之", "寄真", "娇洁", "悦心", "访枫", "水香", "素洁", "韵流", "曼安", "恨蝶", "润洁", "小之", "映阳", "恨松", "静恬", "傲云", "湛霞", "甄梨", "悦怡", "亦丝", "布凡", "曼容", "心宜", "以晴", "冬灵", "飞兰", "山芙", "昱瑛", "歌阑", "梦桃", "曼寒", "梦桐", "向晨", "尔丝", "忆安", "妙竹", "晓灵", "幻莲", "娅清", "忆寒", "晏然", "恨桃", "箫笛", "富霞", "尔云", "美芳", "安彤", "梓欣", "翠风", "琬莹", "映真", "嘉言", "孤萍", "慕诗", "依然", "开琼", "千怡", "婧芸", "幼萱", "音仪", "代柔", "忆山", "诗晗", "晓兰", "祖萍", "星瞳", "米莱", "春霞", "友琴", "真洁", "慕灵", "锐洁", "心慈", "乃心", "瑞芬", "慧云", "古兰", "小琴", "瑞芝", "彗云", "月怡", "紫凝", "小瑜", "静晨", "梦丝", "尔珍", "山梅", "雁风", "裕梅", "欣愉", "梦之", "念寒", "依白", "亦瑶", "沛珊", "梦云", "访云", "锦欣", "司辰", "笑珊", "修洁", "惠心", "恨之", "甘泽", "春岚", "晓霞", "慕凝", "恨云", "晓霜", "靖柔", "仙仪", "悠柔", "芳林", "昊怡", "姝妍", "顾萌", "静枫", "锦诗", "琇云", "姗婷", "悦来", "山槐", "羽莹", "碧彤", "代丝", "翠彤", "真仪", "芷蝶", "巧风", "蕊珠", "睿彤", "翠容", "秀如", "秀妮", "新林", "爱萍", "宇芳", "嘉洁", "娇然", "顺慈", "山晴", "春妤", "丹彤", "梓云", "忆彤", "亚玲", "秀娟", "依瑶", "佳妍", "晓瑶", "幻枫", "翠岚", "沛凝", "欣彤", "心怡", "半芹", "幼枫", "诗槐", "晶灵", "以欣", "新梅", "绪婷", "妙彤", "初蝶", "天洁", "冷珍", "立婷", "芳蕤", "痴灵", "梦洁", "梦泽", "千萍", "幻桃", "秀竹", "问兰", "欣怡", "书竹", "映安", "幻梅", "友珊", "星宸", "春竹", "小珍", "映容", "半莲", "嘉云", "高妍", "丝萝", "水彤", "映寒", "婉仪", "惠芳", "彦灵", "运珊", "笑雯", "梦凡", "珂妍", "芮欢", "芮欣", "绮彤", "梓瑶", "郑哲", "望舒", "依婷", "书怡", "斯乔", "赞怡", "翠芙", "绮怀", "依童", "今瑶", "秋彤", "幻丝", "水蓉", "慧玲", "幼丝", "悦欣", "尔风", "紫霜", "紫霞", "紫真", "翠茵", "小妍", "苏格", "珺琦", "晶霞", "北辰", "瑾萱", "珺琪", "紫青", "慧君", "慧琴", "孤云", "妙春", "冬寒", "艳玲", "湛芳", "秋怡", "帮琼", "紫玲", "姣妍", "代云", "傲白", "妙芙", "以云", "君洁", "香芹", "浩岚", "紫琼", "心菱", "锦洁", "傲霜", "青槐", "湘怡", "晶瑶", "小雯", "道芳", "婉清", "冷瞳", "舒岚", "小霜", "尔白", "千柔", "小霞", "贝晨", "水芸", "晏如", "以轩", "笑阳", "炜婷", "新洁", "湛恩", "宫莹", "香菱", "妙菱", "笑白", "梦兰", "诗云", "静槐", "宣蓉", "梓珊", "志芳", "玉怡", "善芳", "沛雯", "馥芬", "向珊", "香桃", "亦寒", "悦淇", "尔安", "洲裴", "盼香", "静丹", "香梅", "映萱", "山灵", "尔容", "月桃", "芮优", "古香", "秋芸", "静云", "碧春", "芝兰", "恺玲", "水格", "泯熙", "孤兰", "舒扬", "悦书", "桂芝", "芮佳", "水桃", "映蓉", "木蓉", "初然", "觅双", "芮澜", "桂芳", "绮菱", "希彤", "悦人", "之柔", "寄春", "笑寒", "秋荣", "郁安", "柯洁", "尔岚", "施然", "艳霞", "琬凝", "娟妍", "秋莲", "米兰", "雍恬", "之桃", "沛岚", "宇丞", "晓彤", "舒荣", "夜天", "暄妍", "品怡", "紫安", "恨真", "冰彤", "粟梅", "幼仪", "妙晴", "湛英", "碧莹", "慧瑶", "婉然", "月明", "笑天", "翠萍", "舒怀", "翠萱", "访琴", "梦琪", "曼柔", "方仪", "清涵", "钊莹", "忻愉", "诗兰", "花泽", "玉英", "慕青", "笑妍", "钰彤", "致萱", "冷安", "芳泽", "保哲", "芳洁", "水晶", "菡梅", "夜白", "秀芳", "易蓉", "书芹", "卿蓉", "秀英", "代双", "代珊", "萱彤", "友容", "立芬", "幻灵", "宵晨", "丹梅", "念芹", "静涵", "锦凡", "献仪", "问香", "小宸", "娅童", "忆梅", "熙怡", "玉萍", "倚云", "星菱", "慧婕", "牧歌", "恨天", "北嘉", "书蝶", "丹洁", "梦秋", "初瑶", "美玲", "瑞云", "暖姝", "娅彤", "米琪", "真如", "奚瑶", "春柔", "一璇", "千兰", "书桃", "香洁", "倩冰", "春桃", "洛灵", "晓芬", "孟阳", "安然", "秀梅", "琲瓃", "夜山", "念桃", "素怀", "千凝", "千凡", "婧瑶", "秋蝶", "春梅", "苏迷", "梦竹", "曼云", "醉蝶", "旭辉", "忆丹", "束芳", "苇然", "绮梅", "彩妍", "忆之", "芬璇", "偌丝", "英豪", "冬莲", "恨竹", "致欣", "桂枫", "梦安", "诺瑶", "莉娉", "觅风", "初阳", "暖瞳", "翠柔", "一凡", "雁芙", "夜香", "紫寒", "星晴", "梓婷", "斯琪", "智宸", "翠桃", "暄婷", "英楠", "代真", "寄柔", "畅然", "紫山", "翠梅", "幻珊", "梓童", "幼珊", "嘉禾", "访风", "之槐", "幸瑶", "列琴", "羽洁", "盼山", "琬玲", "海莲", "巧春", "凤婷", "琨瑜", "琨瑶", "娅庭", "逸云", "乃欣", "佳晨", "海萍", "芷兰", "惋洁", "荇怡", "梦香", "秀杰", "安琪", "沐葵", "雁梅", "锦婷", "幻天", "小萱", "佁然", "晓星", "午瑶", "以山", "翠丝", "晓昕", "曼冬", "忆然", "启颜", "月灵", "依晨", "曼凝", "幻香", "欣然", "婉容", "贝琳", "伊颜", "卿云", "盼芙", "笑萍", "慧心", "嘉怡", "湘云", "秀洁", "专霞", "颖然", "瑛瑶", "访彤", "美如", "晓枫", "一禾", "冬菱", "半凡", "麦冬", "瑞灵", "梦容", "彩娟", "梦寒", "芷珊", "冰莹", "傲芙", "爱琴", "洛凝", "希蓉", "芷琪", "冰萍", "恨寒", "小芬", "夜希", "谧辰", "蕙芸", "忆辰", "亚萍", "皓洁", "苏凌", "水云", "又莲", "一雯", "尔芙", "冷菱", "雁枫", "东玲", "代容", "梓彤", "娅芳", "婉婷", "熙柔", "庆霞", "千琴", "婧雯", "沛芹", "忆灵", "以寒", "友菱", "丝琦", "海桃", "丝琪", "安吉", "之云", "友桃", "箫吟", "静娴", "梓萱", "紫薰", "友梅", "碧凡", "滇萍", "运菱", "钰洁", "西柠", "慧英", "水琼", "悦驰", "芮安", "寄凡", "沛柔", "悦婷", "善玲", "艳芳", "歆然", "水瑶", "舒云", "青寒", "静竹", "惠玲", "楚洁", "永琴", "婉怡", "丝祺", "盼晴", "玉兰", "诗怀", "韵梅", "佩兰", "夜蓉", "小楠", "静安", "木兰", "惠琴", "问枫", "雁丝", "瑾琳", "琇芳", "之瑶", "琇芬", "半香", "抒怀", "瑾瑶", "悦宜", "秀兰", "安阳", "霁芸", "冰蝶", "依柔", "佳洁", "梓舒", "慧恩", "问萍", "小星", "小春", "焱霞", "傲晴", "婧妍", "映之", "清妍", "小晨", "紫菱", "曼玲", "宝琳", "暖怡", "冬梅", "晓桐", "紫萍", "惠然", "颖初", "曼珠", "紫萱", "幼安", "莉绫", "睿琳", "晓梅", "碧灵", "曼吟", "智菱", "歌云", "睿瑶", "书云", "千城", "沛春", "素昕", "念之", "傲松", "朗然", "玉轩", "湘灵", "丹琴", "亚梅", "以彤", "寄灵", "高洁", "半青", "书仪", "睿哲", "妙珍", "晓楠", "依楠", "静香", "绮云", "小枫", "欣琳", "向彤", "三婷", "梓莹", "笑晴", "布欣", "芮婷", "月玲", "梓菱", "奥婷", "欣瑶", "暄莹", "暮芸", "慕梅", "彩萱", "歌玲", "慧晨", "秀珊", "布侬", "紫槐", "素欣", "曼香", "向萍", "晓丝", "妙颜", "星瑶", "奥维", "曼妮", "美怡", "秀君", "天晴", "冬云", "睿姿", "津童", "念双", "念珍", "秀琴", "梦晨", "韵诗", "忆香", "依云", "巧玲", "春琳", "清怡", "嫣然", "雁兰", "忆秋", "小洁", "书瑶", "路英", "攸然", "水风", "绮琴", "海冬", "蔡琳", "梓楠", "新苗", "翠霜", "月天", "悦张", "雁凡", "梓榆", "琇晶", "梦松", "傲丝", "新荣", "依辰", "书兰", "翠玲", "洛妃", "安娴", "曼青", "春兰", "天菱", "彦芝", "海云", "娅楠", "秋灵", "洛离", "代芙", "尔槐", "代芹", "翠琴", "问梅", "绮兰", "妃妍", "碧琳", "巧兰", "楚云", "夜春", "汉玲", "紫桐", "忻然", "琇莹", "艳蓉", "艺萍", "金梅", "初彤", "笑槐", "寄琴", "晓洁", "痴梅", "山彤", "幼怡", "寄瑶", "赫然", "玉环", "旭妍", "玉珂", "冰洁", "安寒", "仲舒", "妙音", "司晨", "瑞娟", "舒兰", "佩珍", "歆琳", "代萱", "以菱", "梓柔", "娅欣"]
let ns = names.length

let toneParam = urlParam('t') || '12,31,32,41,42'

setInterval(() => {
    let indexes = randomHidedIndex()
    if (indexes === null) {
        return
    }
    let item = randomHidedItem(indexes)
    let text = $('<span style="display:none;">' + randomName() + '</span>')
    setItemShow(indexes[0], indexes[1], true)
    item.html(text)
    text.fadeIn(1000)
    setTimeout(() => {
        text.fadeOut(2000)
        setItemShow(indexes[0], indexes[1], false)
    }, 5000)
}, 1000)

function randomName() {
    if (Math.random() < 0.333) {
        let name = names[randomIndex(ns)]
        return lastName + name
    } else {
        let tonePairs = toneParam.split(',')
        let tonePair = tonePairs[randomIndex(tonePairs.length)]
        let toneSplits = tonePair.split('')
        let name1 = randomWord(parseInt(toneSplits[0]))
        let name2 = randomWord(parseInt(toneSplits[1]))
        return lastName + name1 + name2
    }
}

function randomWord(tone) {
    return ts[tone - 1][randomIndex(ss[tone - 1])]
}

function urlParam(p) {
    if (!location.search) {
        return null
    }
    let splits = location.search.split('?')
    let split = splits[splits.length - 1]
    if (!split) {
        return null
    }
    let pairs = split.split('&')
    for (let i = 0; i < pairs.length; i++) {
        let pair = pairs[i]
        if (!pair) {
            continue
        }
        let kv = pair.split('=')
        if (kv.length < 2) {
            continue
        }
        if (kv[0] === p) {
            return kv[1]
        }
    }
}

function randomHidedIndex() {
    let count = 0
    let rowIndex, colIndex
    while (count < maxRow * maxCol) {
        rowIndex = randomIndex(maxRow)
        colIndex = randomIndex(maxCol)
        count++
        if (!getItemShow(rowIndex, colIndex)) {
            return [rowIndex, colIndex]
        }
        console.log('item is showing, r=' + rowIndex + ', c=' + colIndex)
    }
    return null
}

function randomHidedItem(indexes) {
    return $($($('div.row')[indexes[0]]).find('div.col')[indexes[1]])
}

function randomIndex(max) {
    return parseInt(Math.random() * max)
}

function getItemShow(rowIndex, colIndex) {
    return itemShowingMap['r' + rowIndex + 'c' + colIndex] || false
}

function setItemShow(rowIndex, colIndex, show) {
    itemShowingMap['r' + rowIndex + 'c' + colIndex] = show
}
