let time = 3000
let maxRow = 5
let maxCol = 5
let itemShowingMap = {}
let lastName = '袁'
let t1 = ["哀", "埃", "安", "氨", "巴", "叭", "班", "颁", "斑", "搬", "邦", "帮", "包", "胞", "卑", "杯", "悲", "碑", "崩", "逼", "编", "蝙", "鞭", "标", "宾", "滨", "冰", "兵", "拨", "玻", "擦", "猜", "餐", "仓", "苍", "舱", "插", "昌", "抄", "超", "撑", "充", "抽", "出", "初", "川", "穿", "窗", "春", "匆", "葱", "聪", "粗", "催", "村", "搭", "丹", "刀", "灯", "登", "低", "滴", "颠", "雕", "爹", "叮", "盯", "丢", "东", "冬", "督", "端", "吨", "多", "恩", "翻", "方", "芳", "飞", "非", "啡", "纷", "芬", "丰", "风", "枫", "封", "疯", "峰", "锋", "蜂", "肤", "孵", "该", "甘", "肝", "刚", "纲", "缸", "高", "戈", "哥", "鸽", "割", "歌", "根", "跟", "耕", "工", "弓", "公", "功", "攻", "宫", "恭", "沟", "钩", "咕", "姑", "孤", "菇", "瓜", "刮", "关", "官", "光", "归", "规", "郭", "锅", "黑", "轰", "乎", "呼", "忽", "花", "欢", "灰", "恢", "挥", "辉", "徽", "昏", "婚", "击", "饥", "圾", "机", "肌", "鸡", "积", "基", "激", "加", "佳", "嘉", "尖", "坚", "肩", "艰", "兼", "江", "姜", "僵", "疆", "交", "郊", "娇", "浇", "骄", "胶", "焦", "礁", "阶", "皆", "接", "揭", "街", "巾", "今", "金", "津", "筋", "京", "茎", "惊", "晶", "睛", "精", "鲸", "纠", "军", "君", "开", "刊", "堪", "康", "科", "棵", "颗", "坑", "枯", "哭", "夸", "宽", "亏", "昆", "垃", "捞", "妈", "捏", "欧", "拍", "攀", "抛", "胚", "批", "披", "偏", "篇", "飘", "拼", "坡", "泼", "颇", "扑", "七", "戚", "欺", "千", "迁", "牵", "谦", "签", "枪", "腔", "敲", "侵", "青", "氢", "轻", "倾", "清", "丘", "秋", "蚯", "驱", "屈", "躯", "趋", "缺", "扔", "三", "桑", "森", "僧", "杀", "纱", "砂", "山", "衫", "珊", "伤", "商", "烧", "申", "伸", "深", "升", "生", "声", "牲", "尸", "失", "师", "诗", "施", "狮", "湿", "收", "书", "抒", "枢", "殊", "舒", "输", "蔬", "摔", "双", "霜", "丝", "司", "私", "斯", "撕", "松", "搜", "苏", "酸", "虽", "孙", "他", "它", "她", "塌", "胎", "贪", "摊", "滩", "涛", "掏", "梯", "踢", "天", "添", "贴", "厅", "偷", "推", "吞", "托", "拖", "脱", "挖", "蛙", "歪", "弯", "湾", "汪", "威", "温", "翁", "窝", "污", "屋", "西", "吸", "希", "析", "牺", "悉", "晰", "稀", "锡", "熙", "嘻", "膝", "瞎", "仙", "先", "掀", "乡", "香", "厢", "湘", "箱", "消", "萧", "硝", "销", "歇", "心", "辛", "欣", "新", "星", "猩", "凶", "兄", "匈", "胸", "休", "修", "羞", "须", "虚", "需", "宣", "鸦", "鸭", "央", "腰", "邀", "一", "伊", "医", "依", "因", "阴", "音", "英", "婴", "鹰", "拥", "优", "忧", "幽", "悠", "曰", "灾", "栽", "遭", "糟", "增", "沾", "张", "章", "招", "针", "侦", "珍", "真", "争", "征", "睁", "蒸", "之", "支", "汁", "芝", "织", "肢", "脂", "蜘", "忠", "终", "钟", "州", "舟", "周", "洲", "朱", "株", "珠", "诸", "猪", "蛛", "抓", "专", "砖", "庄", "桩", "装", "追", "捉", "桌", "姿", "资", "滋", "宗", "棕", "踪", "租", "尊", "遵", "庵", "鞍", "肮", "芭", "疤", "捌", "梆", "苞", "褒", "彪", "憋", "鳖", "彬", "斌", "缤", "濒", "菠", "沧", "糙", "搀", "猖", "钞", "痴", "囱", "疮", "椿", "戳", "崔", "摧", "搓", "耽", "掂", "滇", "巅", "刁", "叼", "兜", "墩", "哆", "妃", "吩", "氛", "敷", "柑", "竿", "尴", "冈", "肛", "羔", "糕", "疙", "庚", "羹", "蚣", "躬", "沽", "辜", "乖", "棺", "闺", "瑰", "酣", "憨", "烘", "讥", "叽", "唧", "畸", "奸", "歼", "煎", "缰", "椒", "跤", "秸", "襟", "荆", "兢", "揪", "拘", "驹", "娟", "捐", "鹃", "钧", "揩", "糠", "苛", "磕", "蝌", "抠", "窟", "筐", "盔", "窥", "坤", "拎", "啰", "咪", "妮", "殴", "鸥", "趴", "啪", "潘", "乓", "砰", "烹", "坯", "霹", "翩", "乒", "柒", "凄", "掐", "跷", "锹", "钦", "卿", "蜻", "岖", "腮", "叁", "搔", "骚", "鲨", "筛", "删", "奢", "呻", "绅", "笙", "甥", "梳", "拴", "栓", "嘶", "酥", "唆", "梭", "嗦", "瘫", "滔", "剔", "秃", "洼", "豌", "偎", "瘟", "嗡", "蜗", "呜", "诬", "犀", "蟋", "镶", "宵", "潇", "箫", "霄", "锌", "薪", "腥", "汹", "墟", "轩", "喧", "靴", "薛", "勋", "丫", "焉", "殃", "秧", "鸯", "吆", "妖", "壹", "姻", "茵", "莺", "樱", "鹦", "庸", "迂", "淤", "冤", "鸳", "渊", "哉", "赃", "憎", "斋", "毡", "瞻", "彰", "樟", "昭", "贞", "斟", "狰", "筝", "衷", "妆", "锥", "谆", "咨", "赊"]
let t2 = ["昂", "拔", "白", "鼻", "脖", "驳", "勃", "博", "搏", "才", "材", "财", "裁", "残", "曹", "槽", "层", "茶", "察", "柴", "缠", "肠", "尝", "偿", "常", "巢", "潮", "尘", "臣", "沉", "陈", "成", "呈", "承", "诚", "城", "惩", "程", "池", "驰", "迟", "持", "崇", "绸", "愁", "筹", "酬", "除", "厨", "船", "床", "晨", "垂", "锤", "纯", "唇", "醇", "词", "瓷", "慈", "辞", "磁", "丛", "存", "达", "德", "迪", "敌", "笛", "叠", "蝶", "毒", "独", "夺", "鹅", "额", "而", "乏", "罚", "阀", "凡", "烦", "防", "房", "肪", "肥", "坟", "逢", "弗", "伏", "扶", "浮", "符", "幅", "福", "辐", "蝠", "阁", "格", "隔", "国", "孩", "含", "函", "寒", "韩", "杭", "航", "毫", "豪", "河", "盒", "痕", "恒", "衡", "宏", "洪", "鸿", "喉", "猴", "狐", "胡", "壶", "湖", "葫", "蝴", "怀", "淮", "环", "皇", "黄", "煌", "回", "浑", "魂", "活", "及", "吉", "级", "即", "极", "急", "疾", "集", "籍", "劫", "杰", "洁", "捷", "截", "竭", "局", "菊", "橘", "决", "绝", "掘", "狂", "葵", "来", "莱", "兰", "拦", "栏", "篮", "狼", "廊", "劳", "牢", "雷", "厘", "梨", "离", "犁", "黎", "连", "帘", "莲", "联", "廉", "良", "梁", "粮", "辽", "疗", "聊", "僚", "邻", "林", "临", "磷", "灵", "玲", "凌", "铃", "陵", "羚", "零", "龄", "刘", "流", "留", "硫", "瘤", "龙", "楼", "卢", "炉", "驴", "伦", "轮", "萝", "逻", "螺", "蛮", "忙", "盲", "茫", "毛", "矛", "茅", "枚", "玫", "眉", "梅", "媒", "煤", "霉", "门", "萌", "弥", "迷", "眠", "绵", "棉", "苗", "描", "民", "名", "明", "鸣", "蘑", "魔", "谋", "拿", "男", "能", "尼", "年", "娘", "您", "凝", "牛", "农", "浓", "奴", "挪", "爬", "牌", "盘", "庞", "陪", "培", "赔", "盆", "朋", "棚", "蓬", "鹏", "膨", "皮", "疲", "脾", "瓢", "贫", "频", "平", "评", "凭", "瓶", "萍", "婆", "葡", "蒲", "歧", "骑", "棋", "旗", "前", "钱", "潜", "墙", "乔", "桥", "秦", "琴", "禽", "勤", "晴", "穷", "求", "球", "全", "权", "泉", "拳", "裙", "群", "然", "燃", "饶", "人", "仁", "仍", "绒", "荣", "容", "溶", "熔", "融", "柔", "如", "儒", "啥", "舌", "神", "绳", "十", "时", "实", "蚀", "俗", "随", "抬", "坛", "谈", "潭", "唐", "堂", "塘", "糖", "逃", "桃", "淘", "萄", "疼", "腾", "藤", "啼", "题", "蹄", "田", "甜", "填", "条", "廷", "亭", "庭", "停", "蜓", "桐", "铜", "童", "头", "投", "图", "徒", "涂", "途", "屠", "团", "驼", "娃", "丸", "完", "顽", "围", "违", "惟", "维", "闻", "蚊", "吴", "吾", "习", "席", "袭", "媳", "峡", "狭", "辖", "霞", "闲", "弦", "贤", "咸", "衔", "嫌", "详", "祥", "翔", "协", "胁", "谐", "携", "鞋", "刑", "形", "型", "雄", "熊", "徐", "玄", "悬", "学", "巡", "询", "循", "牙", "延", "严", "言", "岩", "炎", "盐", "颜", "扬", "羊", "阳", "杨", "洋", "摇", "遥", "爷", "仪", "夷", "宜", "姨", "移", "疑", "吟", "银", "迎", "盈", "营", "蝇", "赢", "尤", "犹", "由", "邮", "油", "游", "于", "鱼", "娱", "渔", "愉", "愚", "元", "园", "原", "圆", "袁", "援", "缘", "源", "云", "匀", "杂", "砸", "则", "泽", "责", "贼", "哲", "执", "直", "值", "职", "植", "竹", "烛", "逐", "族", "昨", "跋", "雹", "舶", "渤", "惭", "豺", "馋", "蝉", "忱", "辰", "弛", "畴", "稠", "锄", "雏", "橱", "捶", "淳", "祠", "涤", "迭", "谍", "碟", "踱", "讹", "娥", "峨", "筏", "矾", "焚", "芙", "俘", "袱", "涵", "嚎", "禾", "弘", "弧", "猾", "槐", "凰", "惶", "蝗", "簧", "棘", "嫉", "颊", "睫", "诀", "崛", "爵", "魁", "婪", "澜", "琅", "榔", "狸", "漓", "篱", "镰", "粱", "寥", "嘹", "缭", "琳", "鳞", "伶", "聆", "菱", "浏", "琉", "榴", "咙", "胧", "聋", "窿", "娄", "庐", "颅", "峦", "仑", "沦", "锣", "箩", "骡", "馒", "瞒", "锚", "朦", "檬", "瞄", "冥", "铭", "馍", "摹", "挠", "狞", "柠", "脓", "徘", "螃", "袍", "彭", "篷", "啤", "坪", "菩", "祈", "脐", "崎", "鳍", "钳", "黔", "侨", "憔", "芹", "擒", "擎", "琼", "囚", "渠", "痊", "瘸", "瓤", "壬", "戎", "蓉", "榕", "揉", "蹂", "赎", "隋", "痰", "谭", "檀", "棠", "膛", "誊", "恬", "迢", "彤", "瞳", "颓", "豚", "臀", "鸵", "帷", "芜", "梧", "蜈", "匣", "侠", "旬", "涯", "衙", "阎", "蜒", "尧", "肴", "姚", "窑", "谣", "怡", "贻", "胰", "寅", "淫", "荧", "莹", "萤", "渝", "隅", "逾", "榆", "舆", "猿", "耘", "闸", "辙", "侄", "灼", "茁", "浊", "酌", "啄", "佘"]
let t3 = ["矮", "俺", "摆", "板", "版", "宝", "饱", "保", "北", "本", "彼", "笔", "表", "丙", "饼", "补", "捕", "彩", "踩", "草", "产", "阐", "炒", "扯", "闯", "齿", "丑", "瞅", "础", "储", "楚", "喘", "此", "胆", "党", "导", "岛", "蹈", "等", "抵", "典", "顶", "懂", "抖", "陡", "堵", "赌", "短", "朵", "躲", "尔", "耳", "法", "反", "返", "仿", "访", "纺", "粉", "抚", "府", "辅", "腐", "改", "赶", "敢", "感", "港", "搞", "稿", "巩", "拱", "狗", "古", "股", "拐", "馆", "管", "轨", "鬼", "滚", "果", "裹", "海", "罕", "喊", "很", "狠", "吼", "缓", "毁", "悔", "火", "伙", "己", "挤", "甲", "钾", "减", "剪", "检", "简", "碱", "讲", "奖", "蒋", "姐", "紧", "锦", "井", "警", "九", "久", "酒", "举", "凯", "砍", "考", "烤", "渴", "肯", "孔", "恐", "口", "苦", "款", "览", "懒", "朗", "老", "蕾", "冷", "礼", "李", "理", "鲤", "脸", "两", "领", "岭", "柳", "垄", "拢", "鲁", "旅", "铝", "履", "卵", "裸", "马", "玛", "码", "买", "满", "每", "美", "猛", "米", "勉", "秒", "敏", "某", "母", "亩", "牡", "姆", "拇", "乃", "奶", "恼", "脑", "你", "拟", "扭", "纽", "暖", "偶", "捧", "品", "浦", "普", "谱", "岂", "启", "起", "遣", "巧", "顷", "请", "取", "染", "壤", "扰", "惹", "忍", "乳", "软", "洒", "伞", "嗓", "嫂", "傻", "闪", "陕", "赏", "审", "婶", "史", "始", "驶", "手", "守", "首", "暑", "鼠", "薯", "耍", "甩", "爽", "水", "死", "耸", "髓", "损", "笋", "所", "索", "锁", "坦", "躺", "讨", "铁", "挺", "艇", "统", "桶", "筒", "土", "腿", "妥", "挽", "晚", "碗", "网", "伟", "伪", "纬", "吻", "稳", "我", "五", "午", "伍", "武", "舞", "喜", "显", "险", "享", "响", "想", "小", "晓", "醒", "朽", "许", "选", "衍", "掩", "眼", "演", "仰", "养", "氧", "痒", "咬", "也", "冶", "野", "乙", "已", "以", "矣", "蚁", "引", "蚓", "隐", "影", "永", "泳", "勇", "友", "宇", "羽", "远", "允", "宰", "早", "枣", "藻", "眨", "展", "掌", "找", "者", "诊", "整", "止", "旨", "址", "纸", "趾", "肿", "主", "煮", "嘱", "准", "籽", "紫", "总", "走", "阻", "组", "祖", "嘴", "左", "蔼", "袄", "靶", "绑", "榜", "匕", "贬", "匾", "秉", "禀", "跛", "哺", "睬", "铲", "逞", "侈", "耻", "宠", "蠢", "歹", "捣", "祷", "碘", "鼎", "董", "蚪", "睹", "盹", "饵", "匪", "诽", "讽", "甫", "斧", "俯", "秆", "橄", "埂", "耿", "梗", "苟", "寡", "诡", "癸", "恍", "谎", "幌", "拣", "俭", "柬", "茧", "捡", "桨", "谨", "灸", "玖", "韭", "坎", "拷", "垦", "恳", "啃", "垮", "捆", "揽", "缆", "榄", "垒", "磊", "敛", "凛", "篓", "卤", "虏", "吕", "侣", "屡", "缕", "莽", "卯", "锰", "缅", "渺", "藐", "皿", "闽", "悯", "瑙", "馁", "捻", "撵", "碾", "钮", "藕", "圃", "乞", "谴", "寝", "冉", "冗", "汝", "蕊", "晌", "矢", "屎", "蜀", "吮", "琐", "毯", "淌", "舔", "捅", "椭", "婉", "惋", "枉", "苇", "侮", "鹉", "徙", "癣", "舀", "倚", "瘾", "颖", "咏", "踊", "酉", "屿", "禹", "陨", "蚤", "澡", "斩", "盏", "崭", "辗", "沼", "疹", "拯", "肘", "帚", "拄", "瞩", "姊", "佐"]
let t4 = ["爱", "碍", "岸", "按", "案", "暗", "傲", "奥", "澳", "坝", "爸", "霸", "败", "拜", "办", "半", "伴", "扮", "瓣", "棒", "报", "抱", "豹", "爆", "贝", "备", "倍", "辈", "币", "必", "毕", "闭", "碧", "蔽", "壁", "避", "变", "辨", "辩", "病", "布", "步", "部", "菜", "蔡", "灿", "册", "测", "策", "畅", "唱", "彻", "撤", "衬", "趁", "斥", "赤", "翅", "触", "串", "次", "凑", "促", "脆", "翠", "寸", "措", "错", "代", "带", "袋", "戴", "旦", "但", "诞", "淡", "蛋", "氮", "荡", "到", "盗", "道", "稻", "邓", "凳", "瞪", "弟", "帝", "递", "第", "电", "店", "垫", "淀", "殿", "吊", "钓", "掉", "订", "定", "动", "冻", "洞", "豆", "杜", "渡", "段", "断", "锻", "队", "对", "饿", "鳄", "二", "犯", "饭", "范", "贩", "放", "废", "沸", "肺", "费", "份", "奋", "愤", "粪", "凤", "奉", "付", "妇", "负", "附", "复", "赴", "副", "傅", "富", "赋", "腹", "覆", "钙", "溉", "概", "贡", "构", "购", "够", "固", "故", "顾", "挂", "怪", "贯", "惯", "灌", "罐", "贵", "桂", "棍", "害", "汉", "旱", "浩", "耗", "贺", "赫", "鹤", "恨", "后", "厚", "候", "互", "户", "护", "画", "话", "桦", "幻", "唤", "换", "患", "汇", "绘", "惠", "慧", "或", "货", "获", "祸", "惑", "霍", "计", "记", "忌", "技", "际", "剂", "季", "既", "继", "寄", "驾", "架", "嫁", "稼", "件", "建", "剑", "健", "舰", "践", "鉴", "键", "箭", "匠", "叫", "轿", "较", "介", "戒", "届", "界", "借", "近", "进", "晋", "净", "径", "竞", "竟", "敬", "境", "静", "镜", "旧", "救", "就", "舅", "巨", "拒", "具", "剧", "惧", "距", "聚", "倦", "峻", "抗", "炕", "靠", "克", "客", "课", "控", "扣", "库", "裤", "酷", "跨", "块", "快", "况", "矿", "愧", "困", "扩", "阔", "辣", "赖", "烂", "滥", "浪", "泪", "类", "愣", "莉", "力", "历", "厉", "立", "利", "励", "例", "隶", "粒", "练", "炼", "恋", "链", "亮", "辆", "料", "列", "劣", "烈", "猎", "另", "漏", "录", "鹿", "路", "律", "虑", "氯", "滤", "乱", "略", "洛", "骆", "骂", "迈", "麦", "卖", "曼", "慢", "茂", "贸", "帽", "貌", "妹", "孟", "梦", "密", "蜜", "面", "妙", "庙", "灭", "命", "末", "沫", "陌", "莫", "漠", "墨", "默", "木", "目", "牧", "墓", "幕", "慕", "穆", "内", "纳", "钠", "耐", "闹", "嫩", "逆", "念", "怒", "诺", "帕", "怕", "判", "叛", "盼", "佩", "配", "碰", "屁", "譬", "骗", "票", "破", "气", "弃", "汽", "器", "恰", "窃", "庆", "去", "劝", "却", "确", "鹊", "让", "热", "认", "日", "肉", "入", "锐", "瑞", "润", "弱", "萨", "赛", "晒", "善", "尚", "绍", "哨", "设", "社", "涉", "摄", "肾", "渗", "慎", "圣", "剩", "士", "世", "市", "示", "式", "事", "侍", "势", "视", "试", "饰", "室", "是", "逝", "释", "寿", "受", "兽", "售", "授", "瘦", "束", "述", "树", "竖", "帅", "税", "睡", "顺", "瞬", "四", "寺", "饲", "宋", "送", "颂", "诉", "肃", "素", "速", "塑", "蒜", "算", "岁", "碎", "穗", "太", "态", "泰", "叹", "炭", "碳", "套", "特", "替", "跳", "痛", "透", "兔", "退", "唾", "外", "旺", "望", "卫", "未", "位", "味", "胃", "谓", "喂", "慰", "魏", "问", "沃", "卧", "握", "务", "物", "误", "悟", "雾", "细", "隙", "下", "县", "现", "线", "限", "宪", "陷", "献", "腺", "向", "项", "象", "像", "橡", "孝", "效", "笑", "泄", "泻", "卸", "屑", "械", "谢", "蟹", "杏", "姓", "幸", "性", "秀", "绣", "袖", "嗅", "序", "叙", "绪", "续", "蓄", "训", "讯", "迅", "亚", "厌", "宴", "艳", "验", "焰", "雁", "样", "药", "业", "页", "夜", "义", "亿", "忆", "艺", "议", "亦", "异", "役", "抑", "译", "易", "疫", "益", "谊", "逸", "意", "溢", "毅", "翼", "印", "映", "硬", "用", "又", "右", "幼", "诱", "玉", "郁", "狱", "浴", "预", "域", "欲", "喻", "寓", "御", "裕", "遇", "愈", "誉", "豫", "怨", "院", "愿", "月", "岳", "悦", "阅", "跃", "越", "孕", "运", "韵", "蕴", "再", "在", "暂", "赞", "葬", "灶", "皂", "造", "噪", "燥", "躁", "赠", "债", "战", "站", "丈", "仗", "帐", "胀", "账", "障", "兆", "赵", "照", "罩", "浙", "阵", "振", "镇", "震", "证", "郑", "政", "至", "志", "制", "治", "质", "致", "智", "置", "仲", "众", "宙", "皱", "骤", "住", "助", "注", "贮", "驻", "柱", "祝", "壮", "状", "字", "自", "纵", "奏", "最", "罪", "醉", "坐", "座", "做", "隘", "黯", "懊", "拌", "绊", "谤", "镑", "鲍", "狈", "悖", "惫", "笨", "泵", "蹦", "庇", "毙", "痹", "弊", "璧", "辫", "鬓", "怖", "埠", "簿", "蹭", "岔", "澈", "矗", "赐", "醋", "簇", "窜", "篡", "悴", "粹", "挫", "怠", "贷", "档", "悼", "缔", "蒂", "甸", "玷", "惦", "奠", "栋", "逗", "痘", "妒", "镀", "缎", "兑", "钝", "惰", "跺", "扼", "鄂", "愕", "遏", "噩", "贰", "吠", "忿", "缚", "尬", "丐", "赣", "垢", "雇", "卦", "褂", "逛", "跪", "亥", "骇", "悍", "捍", "焊", "憾", "撼", "翰", "皓", "沪", "宦", "涣", "焕", "痪", "卉", "讳", "诲", "贿", "晦", "秽", "妓", "鲫", "冀", "荐", "贱", "涧", "酱", "窖", "诫", "靖", "臼", "疚", "炬", "绢", "眷", "骏", "竣", "亢", "铐", "叩", "寇", "挎", "筷", "旷", "眶", "馈", "廓", "睐", "涝", "吏", "沥", "俐", "荔", "栗", "砾", "痢", "雳", "谅", "晾", "吝", "赁", "躏", "陋", "赂", "禄", "昧", "媚", "魅", "觅", "蔑", "谬", "茉", "寞", "沐", "募", "睦", "暮", "捺", "匿", "腻", "聂", "孽", "泞", "虐", "懦", "糯", "湃", "畔", "沛", "僻", "聘", "迄", "歉", "俏", "峭", "窍", "撬", "刃", "纫", "韧", "褥", "闰", "涩", "瑟", "霎", "擅", "赡", "赦", "恃", "拭", "柿", "嗜", "誓", "恕", "庶", "墅", "漱", "涮", "烁", "硕", "嗽", "巳", "祀", "肆", "讼", "诵", "粟", "溯", "祟", "隧", "蹋", "汰", "烫", "屉", "剃", "涕", "惕", "蜕", "袜", "腕", "妄", "畏", "猬", "勿", "戊", "馅", "羡", "啸", "懈", "衅", "锈", "旭", "恤", "酗", "婿", "絮", "炫", "绚", "渲", "驯", "汛", "逊", "殉", "讶", "砚", "唁", "谚", "堰", "漾", "邑", "绎", "佑", "芋", "苑", "粤", "酝", "乍", "诈", "榨", "寨", "栈", "绽", "杖", "肇", "蔗", "帜", "挚", "秩", "窒", "滞", "稚", "咒", "昼", "蛀", "铸", "撰", "坠", "缀", "赘", "揍"]
let s1 = t1.length
let s2 = t2.length
let s3 = t3.length
let s4 = t4.length
let ts = [t1, t2, t3, t4]
let ss = [s1, s2, s3, s4]

let toneParam = urlParam('t') || '31,32'

setInterval(() => {
    let indexes = randomHidedIndex()
    if (indexes === null) {
        return
    }
    let item = randomHidedItem(indexes)
    let text = $('<span style="display:none;">' + randomName() + '</span>')
    setItemShow(indexes[0], indexes[1], true)
    item.html(text)
    text.fadeIn(1000)
    setTimeout(() => {
        text.fadeOut(2000)
        setItemShow(indexes[0], indexes[1], false)
    }, 5000)
}, 1000)

function randomName() {
    let tonePairs = toneParam.split(',')
    let tonePair = tonePairs[randomIndex(tonePairs.length)]
    let toneSplits = tonePair.split('')
    let name1 = randomWord(parseInt(toneSplits[0]))
    let name2 = randomWord(parseInt(toneSplits[1]))
    return lastName + name1 + name2
}

function randomWord(tone) {
    return ts[tone - 1][randomIndex(ss[tone - 1])]
}

function urlParam(p) {
    if (!location.search) {
        return null
    }
    let splits = location.search.split('?')
    let split = splits[splits.length - 1]
    if (!split) {
        return null
    }
    let pairs = split.split('&')
    for (let i = 0; i < pairs.length; i++) {
        let pair = pairs[i]
        if (!pair) {
            continue
        }
        let kv = pair.split('=')
        if (kv.length < 2) {
            continue
        }
        if (kv[0] === p) {
            return kv[1]
        }
    }
}

function randomHidedIndex() {
    let count = 0
    let rowIndex, colIndex
    while (count < maxRow * maxCol) {
        rowIndex = randomIndex(maxRow)
        colIndex = randomIndex(maxCol)
        count++
        if (!getItemShow(rowIndex, colIndex)) {
            return [rowIndex, colIndex]
        }
        console.log('item is showing, r=' + rowIndex + ', c=' + colIndex)
    }
    return null
}

function randomHidedItem(indexes) {
    return $($($('div.row')[indexes[0]]).find('div.col')[indexes[1]])
}

function randomIndex(max) {
    return parseInt(Math.random() * max)
}

function getItemShow(rowIndex, colIndex) {
    return itemShowingMap['r' + rowIndex + 'c' + colIndex] || false
}

function setItemShow(rowIndex, colIndex, show) {
    itemShowingMap['r' + rowIndex + 'c' + colIndex] = show
}
